package characters;

import otherComand.OtherValuesInt;

public class Gnome extends Warrior implements MagicPotion{

    //  Класс Гномов


    public Gnome(String race, int healthPoint, int maxInpactForce, int price) {
        super(race, healthPoint, maxInpactForce, price);
    }

    @Override
    public String toString() {
        return getRACE() +
                "\n имя - " + getNAME() +
                "\n здоровье - " + getHealthPoint() + "%" +
                "\n минимальный удар - " + getMIN_IMPACT_FORCE() +
                "\n зелье прибовляет +20 к защите  " +
                "\n цена - " + getPRICE();
    }

    @Override
    public void toAttack() {
        System.out.println("\n\"ГНОМЫ\":");
        System.out.println("░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░▄▄██░\n" +
                "░░░░░░░░░░░░░░▄▄██████▄▄░░░░░░░░░░░▀██░\n" +
                "░░░░░░░░░░░░▄████████████▄░░░░░░░░░░██░\n" +
                "░░░░░░░░░░░████████████████░░░░░░░░░██░\n" +
                "░░░░░░░░░░██████████████████░░░░░░░░██░\n" +
                "░░░░░░░░░░██████████████████░░░░░░█▀██░\n" +
                "░░░░░░░░░░░██▄░░▀▀██▀▀░░▄██░░░░░░░█░██░\n" +
                "░░░░░░░░░░░████████████████░░░░░░░█░██░\n" +
                "░░░░░░░░░░░▀████▀▀▀▀▀▀████▀░░░░░░░█░██░\n" +
                "░░░░░░░░░░░░████░░░░░░████░░░░░░░░█░██░\n" +
                "░░░░░░░░░▄▄▄░▀██████████▀░▄▄▄░░░░░█▄██▄\n" +
                "░░░░░░▄█████░░▀▀█████▀▀▀░░█████░░▄█████\n" +
                "░░░░░████▀▀░▄▄░░░░░░░░░░▄▄░▀▀██░███████\n" +
                "░░░░▀▀░░░░░▀██▄░░░░░░░░▄████▄▄░░███████\n" +
                "░░░░▄▄██░░░░▀██▄░░░░░░▄████████░███████\n" +
                "░▄███████▄░░░░▀██▄▄▄▄██████████░███████\n" +
                "░█████████▄░░░░▀███████████████░███████\n" +
                "████████████▄░░░░░▀████████████░███████");
        System.out.println();
        System.out.println("В БОЙ\n");
        setProtection(protectionRandom());


    }


    @Override
    public void potionPower() {
        System.out.println("\n" +
                "░░░░░░░░░░░░▄▄\n" +
                "░░░░░░░░░░░█░░█\n" +
                "░░░░░░░░░░█░░░█\n" +
                "░░░░░░░░░█░░░░█\n" +
                "███████▄▄█░░░░░██████▄\n" +
                "▓▓▓▓▓▓█░░░░░░░░░░░░░░█\n" +
                "▓▓▓▓▓▓█░░░░░░░░░░░░░░█\n" +
                "▓▓▓▓▓▓█░░░░░░░░░░░░░░█\n" +
                "▓▓▓▓▓▓█░░░░░░░░░░░░░░█\n" +
                "▓▓▓▓▓▓█░░░░░░░░░░░░░░█\n" +
                "▓▓▓▓▓▓█████░░░░░░░░░█\n" +
                "██████▀░░░░▀▀██████▀\n");

        System.out.println(" ЖЕЛЕЗНЫЙ УДАР \n К защите воина +20\n");
        setProtection(getProtection() + OtherValuesInt.POTION.val);
    }
}
